In [2]:
[1+1]

[2]

In [4]:
#pandas course in 13 important command line you should know

In [5]:
import pandas as pd

In [10]:
path = r'C:\Users\my-pc\Desktop\anaconda\hotu_data_scientist_resume\interview 110921\Pandas-tutorials\data\blog_dataset.csv'
data_f=pd.read_csv(path)

In [11]:
data_f.head(7)

,Name,Age,City,State,DOB,Gender,City temperature,Salary
0,Alam,29,Indore,Madhya Pradesh,20-11-1991,Male,35.5,50000
1,Rohit,23,New Delhi,Delhi,19-09-1997,Male,39.0,85000
2,Bimla,35,Rohtak,Haryana,09-01-1985,Female,39.7,20000
3,Rahul,25,Kolkata,West Bengal,19-09-1995,Male,36.5,40000
4,Chaman,32,Chennai,Tamil Nadu,12-03-1988,Male,41.1,65000
5,Vivek,38,Gurugram,Haryana,22-06-1982,Male,38.9,35000
6,Charu,29,New Delhi,Delhi,18-03-1992,Female,39.0,52000

In [12]:
data_f.tail(4)

,Name,Age,City,State,DOB,Gender,City temperature,Salary
5,Vivek,38,Gurugram,Haryana,22-06-1982,Male,38.9,35000
6,Charu,29,New Delhi,Delhi,18-03-1992,Female,39.0,52000
7,Ganesh,39,Patna,Bihar,07-12-1981,Male,NaN,18000
8,Vivek,38,Gurugram,Haryana,22-06-1982,Male,38.9,35000